<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Chapter 1. &#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1072;</title><meta name="generator" content="DocBook XSL Stylesheets V1.68.1"><link rel="start" href="Lab6.4.html" title="&#1040;&#1088;&#1082;&#1072;&#1085;&#1086;&#1080;&#1076;"><link rel="up" href="Lab6.4.html" title="&#1040;&#1088;&#1082;&#1072;&#1085;&#1086;&#1080;&#1076;"><link rel="prev" href="pr01.html" title="&#1055;&#1088;&#1077;&#1072;&#1084;&#1073;&#1091;&#1083;&#1072;"><link rel="next" href="ch02.html" title="Chapter 2. &#1057;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1080;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Chapter 1. &#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1072;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="pr01.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="ch02.html">Next</a></td></tr></table><hr></div><div class="chapter" lang="en"><div class="titlepage"><div><div><h2 class="title"><a name="id1556393"></a>Chapter 1. &#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1072;</h2></div></div></div><p>&#1044;&#1072;&#1085;&#1085;&#1086;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1080;&#1075;&#1088;&#1086;&#1074;&#1099;&#1084; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084; &#1040;&#1088;&#1082;&#1072;&#1085;&#1086;&#1080;&#1076;.</p><p>&#1057;&#1091;&#1090;&#1100; &#1080;&#1075;&#1088;&#1099; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1090;&#1086;&#1084; &#1095;&#1090;&#1086; &#1073;&#1099; &#1085;&#1072;&#1073;&#1088;&#1072;&#1090;&#1100; &#1082;&#1072;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1086;&#1095;&#1082;&#1086;&#1074; &#1091;&#1085;&#1080;&#1095;&#1090;&#1086;&#1078;&#1072;&#1103; &#1082;&#1080;&#1088;&#1087;&#1080;&#1095;&#1080; &#1089; &#1096;&#1072;&#1088;&#1080;&#1082;&#1086;&#1084; &#1085;&#1077; &#1091;&#1088;&#1086;&#1085;&#1080;&#1074; &#1077;&#1075;&#1086; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084;.</p><p>&#1064;&#1072;&#1088;&#1080;&#1082; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090; &#1089;&#1074;&#1086;&#1077; &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086;&#1084; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1089; &#1094;&#1077;&#1085;&#1090;&#1088;&#1072; &#1087;&#1083;&#1072;&#1090;&#1092;&#1086;&#1088;&#1084;&#1099;.</p><p>&#1055;&#1088;&#1080; &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1080; &#1096;&#1072;&#1088;&#1080;&#1082;&#1072; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1080;:</p><div class="itemizedlist"><ul type="disc"><li><p>&#1042;&#1089;&#1090;&#1088;&#1077;&#1095;&#1072; &#1089; &#1073;&#1086;&#1082;&#1086;&#1074;&#1099;&#1084;&#1080; &#1080; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1081; &#1089;&#1090;&#1077;&#1085;&#1082;&#1072;&#1084;&#1080; &#1080;&#1075;&#1088;&#1086;&#1074;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1096;&#1072;&#1088;&#1080;&#1082; &#1086;&#1090;&#1089;&#1082;&#1072;&#1082;&#1080;&#1074;&#1072;&#1077;&#1090; &#1086;&#1090; &#1085;&#1080;&#1093;.</p></li><li><p>&#1054;&#1090;&#1073;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1096;&#1072;&#1088;&#1080;&#1082;&#1072; &#1086;&#1090; &#1087;&#1083;&#1072;&#1090;&#1092;&#1086;&#1088;&#1084;&#1099;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1077;&#1089;&#1083;&#1080; &#1087;&#1083;&#1072;&#1090;&#1092;&#1086;&#1088;&#1084;&#1072; &#1085;&#1077; &#1076;&#1074;&#1080;&#1078;&#1077;&#1090;&#1089;&#1103; &#1096;&#1072;&#1088;&#1080;&#1082; &#1086;&#1090;&#1089;&#1082;&#1072;&#1082;&#1080;&#1074;&#1072;&#1077;&#1090; &#1087;&#1086;&#1076; &#1090;&#1077;&#1084; &#1078;&#1077; &#1091;&#1075;&#1083;&#1086;&#1084; &#1095;&#1090;&#1086; &#1080; &#1091;&#1087;&#1072;&#1083;, &#1077;&#1089;&#1083;&#1080; &#1078;&#1077; &#1087;&#1083;&#1072;&#1090;&#1092;&#1086;&#1088;&#1084;&#1072; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1080; &#1096;&#1072;&#1088;&#1080;&#1082; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1091;&#1075;&#1086;&#1083; &#1086;&#1090;&#1089;&#1082;&#1086;&#1082;&#1072; &#1086;&#1090; &#1087;&#1083;&#1072;&#1090;&#1092;&#1086;&#1088;&#1084;&#1099; &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1090;&#1080; &#1086;&#1090; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1103; &#1087;&#1083;&#1072;&#1090;&#1092;&#1086;&#1088;&#1084;&#1099;. &#1063;&#1077;&#1084; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1081; &#1091;&#1075;&#1086;&#1083; &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1103; &#1096;&#1072;&#1088;&#1080;&#1082;&#1072; &#1090;&#1077;&#1084; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100; &#1076;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;. &#1053;&#1072;&#1080;&#1084;&#1077;&#1085;&#1100;&#1096;&#1072;&#1103; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100; &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1103; &#1096;&#1072;&#1088;&#1080;&#1082;&#1072; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1103; &#1096;&#1072;&#1088;&#1080;&#1082;&#1072; &#1074; &#1074; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080;.</p></li><li><p>&#1042;&#1089;&#1090;&#1088;&#1077;&#1095;&#1072; &#1096;&#1072;&#1088;&#1080;&#1082;&#1072; &#1089; &#1082;&#1080;&#1088;&#1087;&#1080;&#1095;&#1077;&#1084;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1096;&#1072;&#1088;&#1080;&#1082; &#1086;&#1090;&#1089;&#1082;&#1072;&#1082;&#1080;&#1074;&#1072;&#1077;&#1090; &#1082;&#1072;&#1082; &#1087;&#1088;&#1080; &#1089;&#1090;&#1086;&#1083;&#1082;&#1085;&#1086;&#1074;&#1077;&#1085;&#1080;&#1080; &#1086;&#1090; &#1089;&#1090;&#1077;&#1085;&#1086;&#1082;, &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1082;&#1080;&#1088;&#1087;&#1080;&#1095; &#1091;&#1085;&#1080;&#1095;&#1090;&#1086;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080; &#1080;&#1075;&#1088;&#1086;&#1074;&#1086;&#1081; &#1089;&#1095;&#1077;&#1090; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086;&#1077; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1080;&#1088;&#1087;&#1080;&#1095;&#1072;.</p></li><li><p>&#1055;&#1072;&#1076;&#1077;&#1085;&#1080;&#1077; &#1096;&#1072;&#1088;&#1080;&#1082;&#1072; &#1084;&#1080;&#1084;&#1086; &#1087;&#1083;&#1072;&#1090;&#1092;&#1086;&#1088;&#1084;&#1099;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1080;&#1075;&#1088;&#1086;&#1082;&#1091; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1082; &#1089; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084; &#1086;&#1095;&#1082;&#1086;&#1074; &#1085;&#1072;&#1073;&#1088;&#1072;&#1085;&#1099;&#1093; &#1080;&#1084; &#1080; &#1080;&#1075;&#1088;&#1072; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090;&#1089;&#1103; &#1079;&#1072;&#1085;&#1086;&#1074;&#1086;.</p></li></ul></div><p>&#1050;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1086;&#1095;&#1082;&#1086;&#1074; &#1085;&#1072;&#1073;&#1088;&#1072;&#1085;&#1099;&#1093; &#1074; &#1090;&#1077;&#1095;&#1077;&#1085;&#1080;&#1080; &#1080;&#1075;&#1088;&#1099; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1090;&#1077;&#1095;&#1077;&#1085;&#1080;&#1080; &#1074;&#1089;&#1077;&#1081; &#1080;&#1075;&#1088;&#1099; &#1089;&#1083;&#1077;&#1074;&#1072; &#1086;&#1090; &#1080;&#1075;&#1088;&#1086;&#1074;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;.</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="pr01.html">Prev</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="ch02.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#1055;&#1088;&#1077;&#1072;&#1084;&#1073;&#1091;&#1083;&#1072; </td><td width="20%" align="center"><a accesskey="h" href="Lab6.4.html">Home</a></td><td width="40%" align="right" valign="top"> Chapter 2. &#1057;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1080;</td></tr></table></div></body></html>
